bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Driver/regs/i2c_reg.h
/**
  ******************************************************************************
  * @file    i2c_reg.h
  * @version V1.0
  * @date    2022-05-19
  * @brief   This file is the description of.IP register
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2020 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
#ifndef  __I2C_REG_H__
#define  __I2C_REG_H__

#include "bl702l.h"

/* 0x0 : i2c_config */
#define I2C_CONFIG_OFFSET                                       (0x0)
#define I2C_CR_I2C_M_EN                                         I2C_CR_I2C_M_EN
#define I2C_CR_I2C_M_EN_POS                                     (0U)
#define I2C_CR_I2C_M_EN_LEN                                     (1U)
#define I2C_CR_I2C_M_EN_MSK                                     (((1U<<I2C_CR_I2C_M_EN_LEN)-1)<<I2C_CR_I2C_M_EN_POS)
#define I2C_CR_I2C_M_EN_UMSK                                    (~(((1U<<I2C_CR_I2C_M_EN_LEN)-1)<<I2C_CR_I2C_M_EN_POS))
#define I2C_CR_I2C_PKT_DIR                                      I2C_CR_I2C_PKT_DIR
#define I2C_CR_I2C_PKT_DIR_POS                                  (1U)
#define I2C_CR_I2C_PKT_DIR_LEN                                  (1U)
#define I2C_CR_I2C_PKT_DIR_MSK                                  (((1U<<I2C_CR_I2C_PKT_DIR_LEN)-1)<<I2C_CR_I2C_PKT_DIR_POS)
#define I2C_CR_I2C_PKT_DIR_UMSK                                 (~(((1U<<I2C_CR_I2C_PKT_DIR_LEN)-1)<<I2C_CR_I2C_PKT_DIR_POS))
#define I2C_CR_I2C_DEG_EN                                       I2C_CR_I2C_DEG_EN
#define I2C_CR_I2C_DEG_EN_POS                                   (2U)
#define I2C_CR_I2C_DEG_EN_LEN                                   (1U)
#define I2C_CR_I2C_DEG_EN_MSK                                   (((1U<<I2C_CR_I2C_DEG_EN_LEN)-1)<<I2C_CR_I2C_DEG_EN_POS)
#define I2C_CR_I2C_DEG_EN_UMSK                                  (~(((1U<<I2C_CR_I2C_DEG_EN_LEN)-1)<<I2C_CR_I2C_DEG_EN_POS))
#define I2C_CR_I2C_SCL_SYNC_EN                                  I2C_CR_I2C_SCL_SYNC_EN
#define I2C_CR_I2C_SCL_SYNC_EN_POS                              (3U)
#define I2C_CR_I2C_SCL_SYNC_EN_LEN                              (1U)
#define I2C_CR_I2C_SCL_SYNC_EN_MSK                              (((1U<<I2C_CR_I2C_SCL_SYNC_EN_LEN)-1)<<I2C_CR_I2C_SCL_SYNC_EN_POS)
#define I2C_CR_I2C_SCL_SYNC_EN_UMSK                             (~(((1U<<I2C_CR_I2C_SCL_SYNC_EN_LEN)-1)<<I2C_CR_I2C_SCL_SYNC_EN_POS))
#define I2C_CR_I2C_SUB_ADDR_EN                                  I2C_CR_I2C_SUB_ADDR_EN
#define I2C_CR_I2C_SUB_ADDR_EN_POS                              (4U)
#define I2C_CR_I2C_SUB_ADDR_EN_LEN                              (1U)
#define I2C_CR_I2C_SUB_ADDR_EN_MSK                              (((1U<<I2C_CR_I2C_SUB_ADDR_EN_LEN)-1)<<I2C_CR_I2C_SUB_ADDR_EN_POS)
#define I2C_CR_I2C_SUB_ADDR_EN_UMSK                             (~(((1U<<I2C_CR_I2C_SUB_ADDR_EN_LEN)-1)<<I2C_CR_I2C_SUB_ADDR_EN_POS))
#define I2C_CR_I2C_SUB_ADDR_BC                                  I2C_CR_I2C_SUB_ADDR_BC
#define I2C_CR_I2C_SUB_ADDR_BC_POS                              (5U)
#define I2C_CR_I2C_SUB_ADDR_BC_LEN                              (2U)
#define I2C_CR_I2C_SUB_ADDR_BC_MSK                              (((1U<<I2C_CR_I2C_SUB_ADDR_BC_LEN)-1)<<I2C_CR_I2C_SUB_ADDR_BC_POS)
#define I2C_CR_I2C_SUB_ADDR_BC_UMSK                             (~(((1U<<I2C_CR_I2C_SUB_ADDR_BC_LEN)-1)<<I2C_CR_I2C_SUB_ADDR_BC_POS))
#define I2C_CR_I2C_10B_ADDR_EN                                  I2C_CR_I2C_10B_ADDR_EN
#define I2C_CR_I2C_10B_ADDR_EN_POS                              (7U)
#define I2C_CR_I2C_10B_ADDR_EN_LEN                              (1U)
#define I2C_CR_I2C_10B_ADDR_EN_MSK                              (((1U<<I2C_CR_I2C_10B_ADDR_EN_LEN)-1)<<I2C_CR_I2C_10B_ADDR_EN_POS)
#define I2C_CR_I2C_10B_ADDR_EN_UMSK                             (~(((1U<<I2C_CR_I2C_10B_ADDR_EN_LEN)-1)<<I2C_CR_I2C_10B_ADDR_EN_POS))
#define I2C_CR_I2C_SLV_ADDR                                     I2C_CR_I2C_SLV_ADDR
#define I2C_CR_I2C_SLV_ADDR_POS                                 (8U)
#define I2C_CR_I2C_SLV_ADDR_LEN                                 (10U)
#define I2C_CR_I2C_SLV_ADDR_MSK                                 (((1U<<I2C_CR_I2C_SLV_ADDR_LEN)-1)<<I2C_CR_I2C_SLV_ADDR_POS)
#define I2C_CR_I2C_SLV_ADDR_UMSK                                (~(((1U<<I2C_CR_I2C_SLV_ADDR_LEN)-1)<<I2C_CR_I2C_SLV_ADDR_POS))
#define I2C_CR_I2C_PKT_LEN                                      I2C_CR_I2C_PKT_LEN
#define I2C_CR_I2C_PKT_LEN_POS                                  (20U)
#define I2C_CR_I2C_PKT_LEN_LEN                                  (8U)
#define I2C_CR_I2C_PKT_LEN_MSK                                  (((1U<<I2C_CR_I2C_PKT_LEN_LEN)-1)<<I2C_CR_I2C_PKT_LEN_POS)
#define I2C_CR_I2C_PKT_LEN_UMSK                                 (~(((1U<<I2C_CR_I2C_PKT_LEN_LEN)-1)<<I2C_CR_I2C_PKT_LEN_POS))
#define I2C_CR_I2C_DEG_CNT                                      I2C_CR_I2C_DEG_CNT
#define I2C_CR_I2C_DEG_CNT_POS                                  (28U)
#define I2C_CR_I2C_DEG_CNT_LEN                                  (4U)
#define I2C_CR_I2C_DEG_CNT_MSK                                  (((1U<<I2C_CR_I2C_DEG_CNT_LEN)-1)<<I2C_CR_I2C_DEG_CNT_POS)
#define I2C_CR_I2C_DEG_CNT_UMSK                                 (~(((1U<<I2C_CR_I2C_DEG_CNT_LEN)-1)<<I2C_CR_I2C_DEG_CNT_POS))

/* 0x4 : i2c_int_sts */
#define I2C_INT_STS_OFFSET                                      (0x4)
#define I2C_END_INT                                             I2C_END_INT
#define I2C_END_INT_POS                                         (0U)
#define I2C_END_INT_LEN                                         (1U)
#define I2C_END_INT_MSK                                         (((1U<<I2C_END_INT_LEN)-1)<<I2C_END_INT_POS)
#define I2C_END_INT_UMSK                                        (~(((1U<<I2C_END_INT_LEN)-1)<<I2C_END_INT_POS))
#define I2C_TXF_INT                                             I2C_TXF_INT
#define I2C_TXF_INT_POS                                         (1U)
#define I2C_TXF_INT_LEN                                         (1U)
#define I2C_TXF_INT_MSK                                         (((1U<<I2C_TXF_INT_LEN)-1)<<I2C_TXF_INT_POS)
#define I2C_TXF_INT_UMSK                                        (~(((1U<<I2C_TXF_INT_LEN)-1)<<I2C_TXF_INT_POS))
#define I2C_RXF_INT                                             I2C_RXF_INT
#define I2C_RXF_INT_POS                                         (2U)
#define I2C_RXF_INT_LEN                                         (1U)
#define I2C_RXF_INT_MSK                                         (((1U<<I2C_RXF_INT_LEN)-1)<<I2C_RXF_INT_POS)
#define I2C_RXF_INT_UMSK                                        (~(((1U<<I2C_RXF_INT_LEN)-1)<<I2C_RXF_INT_POS))
#define I2C_NAK_INT                                             I2C_NAK_INT
#define I2C_NAK_INT_POS                                         (3U)
#define I2C_NAK_INT_LEN                                         (1U)
#define I2C_NAK_INT_MSK                                         (((1U<<I2C_NAK_INT_LEN)-1)<<I2C_NAK_INT_POS)
#define I2C_NAK_INT_UMSK                                        (~(((1U<<I2C_NAK_INT_LEN)-1)<<I2C_NAK_INT_POS))
#define I2C_ARB_INT                                             I2C_ARB_INT
#define I2C_ARB_INT_POS                                         (4U)
#define I2C_ARB_INT_LEN                                         (1U)
#define I2C_ARB_INT_MSK                                         (((1U<<I2C_ARB_INT_LEN)-1)<<I2C_ARB_INT_POS)
#define I2C_ARB_INT_UMSK                                        (~(((1U<<I2C_ARB_INT_LEN)-1)<<I2C_ARB_INT_POS))
#define I2C_FER_INT                                             I2C_FER_INT
#define I2C_FER_INT_POS                                         (5U)
#define I2C_FER_INT_LEN                                         (1U)
#define I2C_FER_INT_MSK                                         (((1U<<I2C_FER_INT_LEN)-1)<<I2C_FER_INT_POS)
#define I2C_FER_INT_UMSK                                        (~(((1U<<I2C_FER_INT_LEN)-1)<<I2C_FER_INT_POS))
#define I2C_CR_I2C_END_MASK                                     I2C_CR_I2C_END_MASK
#define I2C_CR_I2C_END_MASK_POS                                 (8U)
#define I2C_CR_I2C_END_MASK_LEN                                 (1U)
#define I2C_CR_I2C_END_MASK_MSK                                 (((1U<<I2C_CR_I2C_END_MASK_LEN)-1)<<I2C_CR_I2C_END_MASK_POS)
#define I2C_CR_I2C_END_MASK_UMSK                                (~(((1U<<I2C_CR_I2C_END_MASK_LEN)-1)<<I2C_CR_I2C_END_MASK_POS))
#define I2C_CR_I2C_TXF_MASK                                     I2C_CR_I2C_TXF_MASK
#define I2C_CR_I2C_TXF_MASK_POS                                 (9U)
#define I2C_CR_I2C_TXF_MASK_LEN                                 (1U)
#define I2C_CR_I2C_TXF_MASK_MSK                                 (((1U<<I2C_CR_I2C_TXF_MASK_LEN)-1)<<I2C_CR_I2C_TXF_MASK_POS)
#define I2C_CR_I2C_TXF_MASK_UMSK                                (~(((1U<<I2C_CR_I2C_TXF_MASK_LEN)-1)<<I2C_CR_I2C_TXF_MASK_POS))
#define I2C_CR_I2C_RXF_MASK                                     I2C_CR_I2C_RXF_MASK
#define I2C_CR_I2C_RXF_MASK_POS                                 (10U)
#define I2C_CR_I2C_RXF_MASK_LEN                                 (1U)
#define I2C_CR_I2C_RXF_MASK_MSK                                 (((1U<<I2C_CR_I2C_RXF_MASK_LEN)-1)<<I2C_CR_I2C_RXF_MASK_POS)
#define I2C_CR_I2C_RXF_MASK_UMSK                                (~(((1U<<I2C_CR_I2C_RXF_MASK_LEN)-1)<<I2C_CR_I2C_RXF_MASK_POS))
#define I2C_CR_I2C_NAK_MASK                                     I2C_CR_I2C_NAK_MASK
#define I2C_CR_I2C_NAK_MASK_POS                                 (11U)
#define I2C_CR_I2C_NAK_MASK_LEN                                 (1U)
#define I2C_CR_I2C_NAK_MASK_MSK                                 (((1U<<I2C_CR_I2C_NAK_MASK_LEN)-1)<<I2C_CR_I2C_NAK_MASK_POS)
#define I2C_CR_I2C_NAK_MASK_UMSK                                (~(((1U<<I2C_CR_I2C_NAK_MASK_LEN)-1)<<I2C_CR_I2C_NAK_MASK_POS))
#define I2C_CR_I2C_ARB_MASK                                     I2C_CR_I2C_ARB_MASK
#define I2C_CR_I2C_ARB_MASK_POS                                 (12U)
#define I2C_CR_I2C_ARB_MASK_LEN                                 (1U)
#define I2C_CR_I2C_ARB_MASK_MSK                                 (((1U<<I2C_CR_I2C_ARB_MASK_LEN)-1)<<I2C_CR_I2C_ARB_MASK_POS)
#define I2C_CR_I2C_ARB_MASK_UMSK                                (~(((1U<<I2C_CR_I2C_ARB_MASK_LEN)-1)<<I2C_CR_I2C_ARB_MASK_POS))
#define I2C_CR_I2C_FER_MASK                                     I2C_CR_I2C_FER_MASK
#define I2C_CR_I2C_FER_MASK_POS                                 (13U)
#define I2C_CR_I2C_FER_MASK_LEN                                 (1U)
#define I2C_CR_I2C_FER_MASK_MSK                                 (((1U<<I2C_CR_I2C_FER_MASK_LEN)-1)<<I2C_CR_I2C_FER_MASK_POS)
#define I2C_CR_I2C_FER_MASK_UMSK                                (~(((1U<<I2C_CR_I2C_FER_MASK_LEN)-1)<<I2C_CR_I2C_FER_MASK_POS))
#define I2C_CR_I2C_END_CLR                                      I2C_CR_I2C_END_CLR
#define I2C_CR_I2C_END_CLR_POS                                  (16U)
#define I2C_CR_I2C_END_CLR_LEN                                  (1U)
#define I2C_CR_I2C_END_CLR_MSK                                  (((1U<<I2C_CR_I2C_END_CLR_LEN)-1)<<I2C_CR_I2C_END_CLR_POS)
#define I2C_CR_I2C_END_CLR_UMSK                                 (~(((1U<<I2C_CR_I2C_END_CLR_LEN)-1)<<I2C_CR_I2C_END_CLR_POS))
#define I2C_CR_I2C_NAK_CLR                                      I2C_CR_I2C_NAK_CLR
#define I2C_CR_I2C_NAK_CLR_POS                                  (19U)
#define I2C_CR_I2C_NAK_CLR_LEN                                  (1U)
#define I2C_CR_I2C_NAK_CLR_MSK                                  (((1U<<I2C_CR_I2C_NAK_CLR_LEN)-1)<<I2C_CR_I2C_NAK_CLR_POS)
#define I2C_CR_I2C_NAK_CLR_UMSK                                 (~(((1U<<I2C_CR_I2C_NAK_CLR_LEN)-1)<<I2C_CR_I2C_NAK_CLR_POS))
#define I2C_CR_I2C_ARB_CLR                                      I2C_CR_I2C_ARB_CLR
#define I2C_CR_I2C_ARB_CLR_POS                                  (20U)
#define I2C_CR_I2C_ARB_CLR_LEN                                  (1U)
#define I2C_CR_I2C_ARB_CLR_MSK                                  (((1U<<I2C_CR_I2C_ARB_CLR_LEN)-1)<<I2C_CR_I2C_ARB_CLR_POS)
#define I2C_CR_I2C_ARB_CLR_UMSK                                 (~(((1U<<I2C_CR_I2C_ARB_CLR_LEN)-1)<<I2C_CR_I2C_ARB_CLR_POS))
#define I2C_CR_I2C_END_EN                                       I2C_CR_I2C_END_EN
#define I2C_CR_I2C_END_EN_POS                                   (24U)
#define I2C_CR_I2C_END_EN_LEN                                   (1U)
#define I2C_CR_I2C_END_EN_MSK                                   (((1U<<I2C_CR_I2C_END_EN_LEN)-1)<<I2C_CR_I2C_END_EN_POS)
#define I2C_CR_I2C_END_EN_UMSK                                  (~(((1U<<I2C_CR_I2C_END_EN_LEN)-1)<<I2C_CR_I2C_END_EN_POS))
#define I2C_CR_I2C_TXF_EN                                       I2C_CR_I2C_TXF_EN
#define I2C_CR_I2C_TXF_EN_POS                                   (25U)
#define I2C_CR_I2C_TXF_EN_LEN                                   (1U)
#define I2C_CR_I2C_TXF_EN_MSK                                   (((1U<<I2C_CR_I2C_TXF_EN_LEN)-1)<<I2C_CR_I2C_TXF_EN_POS)
#define I2C_CR_I2C_TXF_EN_UMSK                                  (~(((1U<<I2C_CR_I2C_TXF_EN_LEN)-1)<<I2C_CR_I2C_TXF_EN_POS))
#define I2C_CR_I2C_RXF_EN                                       I2C_CR_I2C_RXF_EN
#define I2C_CR_I2C_RXF_EN_POS                                   (26U)
#define I2C_CR_I2C_RXF_EN_LEN                                   (1U)
#define I2C_CR_I2C_RXF_EN_MSK                                   (((1U<<I2C_CR_I2C_RXF_EN_LEN)-1)<<I2C_CR_I2C_RXF_EN_POS)
#define I2C_CR_I2C_RXF_EN_UMSK                                  (~(((1U<<I2C_CR_I2C_RXF_EN_LEN)-1)<<I2C_CR_I2C_RXF_EN_POS))
#define I2C_CR_I2C_NAK_EN                                       I2C_CR_I2C_NAK_EN
#define I2C_CR_I2C_NAK_EN_POS                                   (27U)
#define I2C_CR_I2C_NAK_EN_LEN                                   (1U)
#define I2C_CR_I2C_NAK_EN_MSK                                   (((1U<<I2C_CR_I2C_NAK_EN_LEN)-1)<<I2C_CR_I2C_NAK_EN_POS)
#define I2C_CR_I2C_NAK_EN_UMSK                                  (~(((1U<<I2C_CR_I2C_NAK_EN_LEN)-1)<<I2C_CR_I2C_NAK_EN_POS))
#define I2C_CR_I2C_ARB_EN                                       I2C_CR_I2C_ARB_EN
#define I2C_CR_I2C_ARB_EN_POS                                   (28U)
#define I2C_CR_I2C_ARB_EN_LEN                                   (1U)
#define I2C_CR_I2C_ARB_EN_MSK                                   (((1U<<I2C_CR_I2C_ARB_EN_LEN)-1)<<I2C_CR_I2C_ARB_EN_POS)
#define I2C_CR_I2C_ARB_EN_UMSK                                  (~(((1U<<I2C_CR_I2C_ARB_EN_LEN)-1)<<I2C_CR_I2C_ARB_EN_POS))
#define I2C_CR_I2C_FER_EN                                       I2C_CR_I2C_FER_EN
#define I2C_CR_I2C_FER_EN_POS                                   (29U)
#define I2C_CR_I2C_FER_EN_LEN                                   (1U)
#define I2C_CR_I2C_FER_EN_MSK                                   (((1U<<I2C_CR_I2C_FER_EN_LEN)-1)<<I2C_CR_I2C_FER_EN_POS)
#define I2C_CR_I2C_FER_EN_UMSK                                  (~(((1U<<I2C_CR_I2C_FER_EN_LEN)-1)<<I2C_CR_I2C_FER_EN_POS))

/* 0x8 : i2c_sub_addr */
#define I2C_SUB_ADDR_OFFSET                                     (0x8)
#define I2C_CR_I2C_SUB_ADDR_B0                                  I2C_CR_I2C_SUB_ADDR_B0
#define I2C_CR_I2C_SUB_ADDR_B0_POS                              (0U)
#define I2C_CR_I2C_SUB_ADDR_B0_LEN                              (8U)
#define I2C_CR_I2C_SUB_ADDR_B0_MSK                              (((1U<<I2C_CR_I2C_SUB_ADDR_B0_LEN)-1)<<I2C_CR_I2C_SUB_ADDR_B0_POS)
#define I2C_CR_I2C_SUB_ADDR_B0_UMSK                             (~(((1U<<I2C_CR_I2C_SUB_ADDR_B0_LEN)-1)<<I2C_CR_I2C_SUB_ADDR_B0_POS))
#define I2C_CR_I2C_SUB_ADDR_B1                                  I2C_CR_I2C_SUB_ADDR_B1
#define I2C_CR_I2C_SUB_ADDR_B1_POS                              (8U)
#define I2C_CR_I2C_SUB_ADDR_B1_LEN                              (8U)
#define I2C_CR_I2C_SUB_ADDR_B1_MSK                              (((1U<<I2C_CR_I2C_SUB_ADDR_B1_LEN)-1)<<I2C_CR_I2C_SUB_ADDR_B1_POS)
#define I2C_CR_I2C_SUB_ADDR_B1_UMSK                             (~(((1U<<I2C_CR_I2C_SUB_ADDR_B1_LEN)-1)<<I2C_CR_I2C_SUB_ADDR_B1_POS))
#define I2C_CR_I2C_SUB_ADDR_B2                                  I2C_CR_I2C_SUB_ADDR_B2
#define I2C_CR_I2C_SUB_ADDR_B2_POS                              (16U)
#define I2C_CR_I2C_SUB_ADDR_B2_LEN                              (8U)
#define I2C_CR_I2C_SUB_ADDR_B2_MSK                              (((1U<<I2C_CR_I2C_SUB_ADDR_B2_LEN)-1)<<I2C_CR_I2C_SUB_ADDR_B2_POS)
#define I2C_CR_I2C_SUB_ADDR_B2_UMSK                             (~(((1U<<I2C_CR_I2C_SUB_ADDR_B2_LEN)-1)<<I2C_CR_I2C_SUB_ADDR_B2_POS))
#define I2C_CR_I2C_SUB_ADDR_B3                                  I2C_CR_I2C_SUB_ADDR_B3
#define I2C_CR_I2C_SUB_ADDR_B3_POS                              (24U)
#define I2C_CR_I2C_SUB_ADDR_B3_LEN                              (8U)
#define I2C_CR_I2C_SUB_ADDR_B3_MSK                              (((1U<<I2C_CR_I2C_SUB_ADDR_B3_LEN)-1)<<I2C_CR_I2C_SUB_ADDR_B3_POS)
#define I2C_CR_I2C_SUB_ADDR_B3_UMSK                             (~(((1U<<I2C_CR_I2C_SUB_ADDR_B3_LEN)-1)<<I2C_CR_I2C_SUB_ADDR_B3_POS))

/* 0xC : i2c_bus_busy */
#define I2C_BUS_BUSY_OFFSET                                     (0xC)
#define I2C_STS_I2C_BUS_BUSY                                    I2C_STS_I2C_BUS_BUSY
#define I2C_STS_I2C_BUS_BUSY_POS                                (0U)
#define I2C_STS_I2C_BUS_BUSY_LEN                                (1U)
#define I2C_STS_I2C_BUS_BUSY_MSK                                (((1U<<I2C_STS_I2C_BUS_BUSY_LEN)-1)<<I2C_STS_I2C_BUS_BUSY_POS)
#define I2C_STS_I2C_BUS_BUSY_UMSK                               (~(((1U<<I2C_STS_I2C_BUS_BUSY_LEN)-1)<<I2C_STS_I2C_BUS_BUSY_POS))
#define I2C_CR_I2C_BUS_BUSY_CLR                                 I2C_CR_I2C_BUS_BUSY_CLR
#define I2C_CR_I2C_BUS_BUSY_CLR_POS                             (1U)
#define I2C_CR_I2C_BUS_BUSY_CLR_LEN                             (1U)
#define I2C_CR_I2C_BUS_BUSY_CLR_MSK                             (((1U<<I2C_CR_I2C_BUS_BUSY_CLR_LEN)-1)<<I2C_CR_I2C_BUS_BUSY_CLR_POS)
#define I2C_CR_I2C_BUS_BUSY_CLR_UMSK                            (~(((1U<<I2C_CR_I2C_BUS_BUSY_CLR_LEN)-1)<<I2C_CR_I2C_BUS_BUSY_CLR_POS))

