bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Driver/regs/i2c_reg.h
/* 0x10 : i2c_prd_start */
#define I2C_PRD_START_OFFSET                                    (0x10)
#define I2C_CR_I2C_PRD_S_PH_0                                   I2C_CR_I2C_PRD_S_PH_0
#define I2C_CR_I2C_PRD_S_PH_0_POS                               (0U)
#define I2C_CR_I2C_PRD_S_PH_0_LEN                               (8U)
#define I2C_CR_I2C_PRD_S_PH_0_MSK                               (((1U<<I2C_CR_I2C_PRD_S_PH_0_LEN)-1)<<I2C_CR_I2C_PRD_S_PH_0_POS)
#define I2C_CR_I2C_PRD_S_PH_0_UMSK                              (~(((1U<<I2C_CR_I2C_PRD_S_PH_0_LEN)-1)<<I2C_CR_I2C_PRD_S_PH_0_POS))
#define I2C_CR_I2C_PRD_S_PH_1                                   I2C_CR_I2C_PRD_S_PH_1
#define I2C_CR_I2C_PRD_S_PH_1_POS                               (8U)
#define I2C_CR_I2C_PRD_S_PH_1_LEN                               (8U)
#define I2C_CR_I2C_PRD_S_PH_1_MSK                               (((1U<<I2C_CR_I2C_PRD_S_PH_1_LEN)-1)<<I2C_CR_I2C_PRD_S_PH_1_POS)
#define I2C_CR_I2C_PRD_S_PH_1_UMSK                              (~(((1U<<I2C_CR_I2C_PRD_S_PH_1_LEN)-1)<<I2C_CR_I2C_PRD_S_PH_1_POS))
#define I2C_CR_I2C_PRD_S_PH_2                                   I2C_CR_I2C_PRD_S_PH_2
#define I2C_CR_I2C_PRD_S_PH_2_POS                               (16U)
#define I2C_CR_I2C_PRD_S_PH_2_LEN                               (8U)
#define I2C_CR_I2C_PRD_S_PH_2_MSK                               (((1U<<I2C_CR_I2C_PRD_S_PH_2_LEN)-1)<<I2C_CR_I2C_PRD_S_PH_2_POS)
#define I2C_CR_I2C_PRD_S_PH_2_UMSK                              (~(((1U<<I2C_CR_I2C_PRD_S_PH_2_LEN)-1)<<I2C_CR_I2C_PRD_S_PH_2_POS))
#define I2C_CR_I2C_PRD_S_PH_3                                   I2C_CR_I2C_PRD_S_PH_3
#define I2C_CR_I2C_PRD_S_PH_3_POS                               (24U)
#define I2C_CR_I2C_PRD_S_PH_3_LEN                               (8U)
#define I2C_CR_I2C_PRD_S_PH_3_MSK                               (((1U<<I2C_CR_I2C_PRD_S_PH_3_LEN)-1)<<I2C_CR_I2C_PRD_S_PH_3_POS)
#define I2C_CR_I2C_PRD_S_PH_3_UMSK                              (~(((1U<<I2C_CR_I2C_PRD_S_PH_3_LEN)-1)<<I2C_CR_I2C_PRD_S_PH_3_POS))

/* 0x14 : i2c_prd_stop */
#define I2C_PRD_STOP_OFFSET                                     (0x14)
#define I2C_CR_I2C_PRD_P_PH_0                                   I2C_CR_I2C_PRD_P_PH_0
#define I2C_CR_I2C_PRD_P_PH_0_POS                               (0U)
#define I2C_CR_I2C_PRD_P_PH_0_LEN                               (8U)
#define I2C_CR_I2C_PRD_P_PH_0_MSK                               (((1U<<I2C_CR_I2C_PRD_P_PH_0_LEN)-1)<<I2C_CR_I2C_PRD_P_PH_0_POS)
#define I2C_CR_I2C_PRD_P_PH_0_UMSK                              (~(((1U<<I2C_CR_I2C_PRD_P_PH_0_LEN)-1)<<I2C_CR_I2C_PRD_P_PH_0_POS))
#define I2C_CR_I2C_PRD_P_PH_1                                   I2C_CR_I2C_PRD_P_PH_1
#define I2C_CR_I2C_PRD_P_PH_1_POS                               (8U)
#define I2C_CR_I2C_PRD_P_PH_1_LEN                               (8U)
#define I2C_CR_I2C_PRD_P_PH_1_MSK                               (((1U<<I2C_CR_I2C_PRD_P_PH_1_LEN)-1)<<I2C_CR_I2C_PRD_P_PH_1_POS)
#define I2C_CR_I2C_PRD_P_PH_1_UMSK                              (~(((1U<<I2C_CR_I2C_PRD_P_PH_1_LEN)-1)<<I2C_CR_I2C_PRD_P_PH_1_POS))
#define I2C_CR_I2C_PRD_P_PH_2                                   I2C_CR_I2C_PRD_P_PH_2
#define I2C_CR_I2C_PRD_P_PH_2_POS                               (16U)
#define I2C_CR_I2C_PRD_P_PH_2_LEN                               (8U)
#define I2C_CR_I2C_PRD_P_PH_2_MSK                               (((1U<<I2C_CR_I2C_PRD_P_PH_2_LEN)-1)<<I2C_CR_I2C_PRD_P_PH_2_POS)
#define I2C_CR_I2C_PRD_P_PH_2_UMSK                              (~(((1U<<I2C_CR_I2C_PRD_P_PH_2_LEN)-1)<<I2C_CR_I2C_PRD_P_PH_2_POS))
#define I2C_CR_I2C_PRD_P_PH_3                                   I2C_CR_I2C_PRD_P_PH_3
#define I2C_CR_I2C_PRD_P_PH_3_POS                               (24U)
#define I2C_CR_I2C_PRD_P_PH_3_LEN                               (8U)
#define I2C_CR_I2C_PRD_P_PH_3_MSK                               (((1U<<I2C_CR_I2C_PRD_P_PH_3_LEN)-1)<<I2C_CR_I2C_PRD_P_PH_3_POS)
#define I2C_CR_I2C_PRD_P_PH_3_UMSK                              (~(((1U<<I2C_CR_I2C_PRD_P_PH_3_LEN)-1)<<I2C_CR_I2C_PRD_P_PH_3_POS))

/* 0x18 : i2c_prd_data */
#define I2C_PRD_DATA_OFFSET                                     (0x18)
#define I2C_CR_I2C_PRD_D_PH_0                                   I2C_CR_I2C_PRD_D_PH_0
#define I2C_CR_I2C_PRD_D_PH_0_POS                               (0U)
#define I2C_CR_I2C_PRD_D_PH_0_LEN                               (8U)
#define I2C_CR_I2C_PRD_D_PH_0_MSK                               (((1U<<I2C_CR_I2C_PRD_D_PH_0_LEN)-1)<<I2C_CR_I2C_PRD_D_PH_0_POS)
#define I2C_CR_I2C_PRD_D_PH_0_UMSK                              (~(((1U<<I2C_CR_I2C_PRD_D_PH_0_LEN)-1)<<I2C_CR_I2C_PRD_D_PH_0_POS))
#define I2C_CR_I2C_PRD_D_PH_1                                   I2C_CR_I2C_PRD_D_PH_1
#define I2C_CR_I2C_PRD_D_PH_1_POS                               (8U)
#define I2C_CR_I2C_PRD_D_PH_1_LEN                               (8U)
#define I2C_CR_I2C_PRD_D_PH_1_MSK                               (((1U<<I2C_CR_I2C_PRD_D_PH_1_LEN)-1)<<I2C_CR_I2C_PRD_D_PH_1_POS)
#define I2C_CR_I2C_PRD_D_PH_1_UMSK                              (~(((1U<<I2C_CR_I2C_PRD_D_PH_1_LEN)-1)<<I2C_CR_I2C_PRD_D_PH_1_POS))
#define I2C_CR_I2C_PRD_D_PH_2                                   I2C_CR_I2C_PRD_D_PH_2
#define I2C_CR_I2C_PRD_D_PH_2_POS                               (16U)
#define I2C_CR_I2C_PRD_D_PH_2_LEN                               (8U)
#define I2C_CR_I2C_PRD_D_PH_2_MSK                               (((1U<<I2C_CR_I2C_PRD_D_PH_2_LEN)-1)<<I2C_CR_I2C_PRD_D_PH_2_POS)
#define I2C_CR_I2C_PRD_D_PH_2_UMSK                              (~(((1U<<I2C_CR_I2C_PRD_D_PH_2_LEN)-1)<<I2C_CR_I2C_PRD_D_PH_2_POS))
#define I2C_CR_I2C_PRD_D_PH_3                                   I2C_CR_I2C_PRD_D_PH_3
#define I2C_CR_I2C_PRD_D_PH_3_POS                               (24U)
#define I2C_CR_I2C_PRD_D_PH_3_LEN                               (8U)
#define I2C_CR_I2C_PRD_D_PH_3_MSK                               (((1U<<I2C_CR_I2C_PRD_D_PH_3_LEN)-1)<<I2C_CR_I2C_PRD_D_PH_3_POS)
#define I2C_CR_I2C_PRD_D_PH_3_UMSK                              (~(((1U<<I2C_CR_I2C_PRD_D_PH_3_LEN)-1)<<I2C_CR_I2C_PRD_D_PH_3_POS))

/* 0x80 : i2c_fifo_config_0 */
#define I2C_FIFO_CONFIG_0_OFFSET                                (0x80)
#define I2C_DMA_TX_EN                                           I2C_DMA_TX_EN
#define I2C_DMA_TX_EN_POS                                       (0U)
#define I2C_DMA_TX_EN_LEN                                       (1U)
#define I2C_DMA_TX_EN_MSK                                       (((1U<<I2C_DMA_TX_EN_LEN)-1)<<I2C_DMA_TX_EN_POS)
#define I2C_DMA_TX_EN_UMSK                                      (~(((1U<<I2C_DMA_TX_EN_LEN)-1)<<I2C_DMA_TX_EN_POS))
#define I2C_DMA_RX_EN                                           I2C_DMA_RX_EN
#define I2C_DMA_RX_EN_POS                                       (1U)
#define I2C_DMA_RX_EN_LEN                                       (1U)
#define I2C_DMA_RX_EN_MSK                                       (((1U<<I2C_DMA_RX_EN_LEN)-1)<<I2C_DMA_RX_EN_POS)
#define I2C_DMA_RX_EN_UMSK                                      (~(((1U<<I2C_DMA_RX_EN_LEN)-1)<<I2C_DMA_RX_EN_POS))
#define I2C_TX_FIFO_CLR                                         I2C_TX_FIFO_CLR
#define I2C_TX_FIFO_CLR_POS                                     (2U)
#define I2C_TX_FIFO_CLR_LEN                                     (1U)
#define I2C_TX_FIFO_CLR_MSK                                     (((1U<<I2C_TX_FIFO_CLR_LEN)-1)<<I2C_TX_FIFO_CLR_POS)
#define I2C_TX_FIFO_CLR_UMSK                                    (~(((1U<<I2C_TX_FIFO_CLR_LEN)-1)<<I2C_TX_FIFO_CLR_POS))
#define I2C_RX_FIFO_CLR                                         I2C_RX_FIFO_CLR
#define I2C_RX_FIFO_CLR_POS                                     (3U)
#define I2C_RX_FIFO_CLR_LEN                                     (1U)
#define I2C_RX_FIFO_CLR_MSK                                     (((1U<<I2C_RX_FIFO_CLR_LEN)-1)<<I2C_RX_FIFO_CLR_POS)
#define I2C_RX_FIFO_CLR_UMSK                                    (~(((1U<<I2C_RX_FIFO_CLR_LEN)-1)<<I2C_RX_FIFO_CLR_POS))
#define I2C_TX_FIFO_OVERFLOW                                    I2C_TX_FIFO_OVERFLOW
#define I2C_TX_FIFO_OVERFLOW_POS                                (4U)
#define I2C_TX_FIFO_OVERFLOW_LEN                                (1U)
#define I2C_TX_FIFO_OVERFLOW_MSK                                (((1U<<I2C_TX_FIFO_OVERFLOW_LEN)-1)<<I2C_TX_FIFO_OVERFLOW_POS)
#define I2C_TX_FIFO_OVERFLOW_UMSK                               (~(((1U<<I2C_TX_FIFO_OVERFLOW_LEN)-1)<<I2C_TX_FIFO_OVERFLOW_POS))
#define I2C_TX_FIFO_UNDERFLOW                                   I2C_TX_FIFO_UNDERFLOW
#define I2C_TX_FIFO_UNDERFLOW_POS                               (5U)
#define I2C_TX_FIFO_UNDERFLOW_LEN                               (1U)
#define I2C_TX_FIFO_UNDERFLOW_MSK                               (((1U<<I2C_TX_FIFO_UNDERFLOW_LEN)-1)<<I2C_TX_FIFO_UNDERFLOW_POS)
#define I2C_TX_FIFO_UNDERFLOW_UMSK                              (~(((1U<<I2C_TX_FIFO_UNDERFLOW_LEN)-1)<<I2C_TX_FIFO_UNDERFLOW_POS))
#define I2C_RX_FIFO_OVERFLOW                                    I2C_RX_FIFO_OVERFLOW
#define I2C_RX_FIFO_OVERFLOW_POS                                (6U)
#define I2C_RX_FIFO_OVERFLOW_LEN                                (1U)
#define I2C_RX_FIFO_OVERFLOW_MSK                                (((1U<<I2C_RX_FIFO_OVERFLOW_LEN)-1)<<I2C_RX_FIFO_OVERFLOW_POS)
#define I2C_RX_FIFO_OVERFLOW_UMSK                               (~(((1U<<I2C_RX_FIFO_OVERFLOW_LEN)-1)<<I2C_RX_FIFO_OVERFLOW_POS))
#define I2C_RX_FIFO_UNDERFLOW                                   I2C_RX_FIFO_UNDERFLOW
#define I2C_RX_FIFO_UNDERFLOW_POS                               (7U)
#define I2C_RX_FIFO_UNDERFLOW_LEN                               (1U)
#define I2C_RX_FIFO_UNDERFLOW_MSK                               (((1U<<I2C_RX_FIFO_UNDERFLOW_LEN)-1)<<I2C_RX_FIFO_UNDERFLOW_POS)
#define I2C_RX_FIFO_UNDERFLOW_UMSK                              (~(((1U<<I2C_RX_FIFO_UNDERFLOW_LEN)-1)<<I2C_RX_FIFO_UNDERFLOW_POS))

