bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Driver/regs/i2c_reg.h
/* 0x84 : i2c_fifo_config_1 */
#define I2C_FIFO_CONFIG_1_OFFSET                                (0x84)
#define I2C_TX_FIFO_CNT                                         I2C_TX_FIFO_CNT
#define I2C_TX_FIFO_CNT_POS                                     (0U)
#define I2C_TX_FIFO_CNT_LEN                                     (2U)
#define I2C_TX_FIFO_CNT_MSK                                     (((1U<<I2C_TX_FIFO_CNT_LEN)-1)<<I2C_TX_FIFO_CNT_POS)
#define I2C_TX_FIFO_CNT_UMSK                                    (~(((1U<<I2C_TX_FIFO_CNT_LEN)-1)<<I2C_TX_FIFO_CNT_POS))
#define I2C_RX_FIFO_CNT                                         I2C_RX_FIFO_CNT
#define I2C_RX_FIFO_CNT_POS                                     (8U)
#define I2C_RX_FIFO_CNT_LEN                                     (2U)
#define I2C_RX_FIFO_CNT_MSK                                     (((1U<<I2C_RX_FIFO_CNT_LEN)-1)<<I2C_RX_FIFO_CNT_POS)
#define I2C_RX_FIFO_CNT_UMSK                                    (~(((1U<<I2C_RX_FIFO_CNT_LEN)-1)<<I2C_RX_FIFO_CNT_POS))
#define I2C_TX_FIFO_TH                                          I2C_TX_FIFO_TH
#define I2C_TX_FIFO_TH_POS                                      (16U)
#define I2C_TX_FIFO_TH_LEN                                      (1U)
#define I2C_TX_FIFO_TH_MSK                                      (((1U<<I2C_TX_FIFO_TH_LEN)-1)<<I2C_TX_FIFO_TH_POS)
#define I2C_TX_FIFO_TH_UMSK                                     (~(((1U<<I2C_TX_FIFO_TH_LEN)-1)<<I2C_TX_FIFO_TH_POS))
#define I2C_RX_FIFO_TH                                          I2C_RX_FIFO_TH
#define I2C_RX_FIFO_TH_POS                                      (24U)
#define I2C_RX_FIFO_TH_LEN                                      (1U)
#define I2C_RX_FIFO_TH_MSK                                      (((1U<<I2C_RX_FIFO_TH_LEN)-1)<<I2C_RX_FIFO_TH_POS)
#define I2C_RX_FIFO_TH_UMSK                                     (~(((1U<<I2C_RX_FIFO_TH_LEN)-1)<<I2C_RX_FIFO_TH_POS))

/* 0x88 : i2c_fifo_wdata */
#define I2C_FIFO_WDATA_OFFSET                                   (0x88)
#define I2C_FIFO_WDATA                                          I2C_FIFO_WDATA
#define I2C_FIFO_WDATA_POS                                      (0U)
#define I2C_FIFO_WDATA_LEN                                      (32U)
#define I2C_FIFO_WDATA_MSK                                      (((1U<<I2C_FIFO_WDATA_LEN)-1)<<I2C_FIFO_WDATA_POS)
#define I2C_FIFO_WDATA_UMSK                                     (~(((1U<<I2C_FIFO_WDATA_LEN)-1)<<I2C_FIFO_WDATA_POS))

/* 0x8C : i2c_fifo_rdata */
#define I2C_FIFO_RDATA_OFFSET                                   (0x8C)
#define I2C_FIFO_RDATA                                          I2C_FIFO_RDATA
#define I2C_FIFO_RDATA_POS                                      (0U)
#define I2C_FIFO_RDATA_LEN                                      (32U)
#define I2C_FIFO_RDATA_MSK                                      (((1U<<I2C_FIFO_RDATA_LEN)-1)<<I2C_FIFO_RDATA_POS)
#define I2C_FIFO_RDATA_UMSK                                     (~(((1U<<I2C_FIFO_RDATA_LEN)-1)<<I2C_FIFO_RDATA_POS))


struct  i2c_reg {
    /* 0x0 : i2c_config */
    union {
        struct {
            uint32_t cr_i2c_m_en                    :  1; /* [    0],        r/w,        0x0 */
            uint32_t cr_i2c_pkt_dir                 :  1; /* [    1],        r/w,        0x1 */
            uint32_t cr_i2c_deg_en                  :  1; /* [    2],        r/w,        0x0 */
            uint32_t cr_i2c_scl_sync_en             :  1; /* [    3],        r/w,        0x1 */
            uint32_t cr_i2c_sub_addr_en             :  1; /* [    4],        r/w,        0x0 */
            uint32_t cr_i2c_sub_addr_bc             :  2; /* [ 6: 5],        r/w,        0x0 */
            uint32_t cr_i2c_10b_addr_en             :  1; /* [    7],        r/w,        0x0 */
            uint32_t cr_i2c_slv_addr                : 10; /* [17: 8],        r/w,        0x0 */
            uint32_t reserved_18_19                 :  2; /* [19:18],       rsvd,        0x0 */
            uint32_t cr_i2c_pkt_len                 :  8; /* [27:20],        r/w,        0x0 */
            uint32_t cr_i2c_deg_cnt                 :  4; /* [31:28],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } i2c_config;

    /* 0x4 : i2c_int_sts */
    union {
        struct {
            uint32_t i2c_end_int                    :  1; /* [    0],          r,        0x0 */
            uint32_t i2c_txf_int                    :  1; /* [    1],          r,        0x1 */
            uint32_t i2c_rxf_int                    :  1; /* [    2],          r,        0x0 */
            uint32_t i2c_nak_int                    :  1; /* [    3],          r,        0x0 */
            uint32_t i2c_arb_int                    :  1; /* [    4],          r,        0x0 */
            uint32_t i2c_fer_int                    :  1; /* [    5],          r,        0x0 */
            uint32_t reserved_6_7                   :  2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t cr_i2c_end_mask                :  1; /* [    8],        r/w,        0x1 */
            uint32_t cr_i2c_txf_mask                :  1; /* [    9],        r/w,        0x1 */
            uint32_t cr_i2c_rxf_mask                :  1; /* [   10],        r/w,        0x1 */
            uint32_t cr_i2c_nak_mask                :  1; /* [   11],        r/w,        0x1 */
            uint32_t cr_i2c_arb_mask                :  1; /* [   12],        r/w,        0x1 */
            uint32_t cr_i2c_fer_mask                :  1; /* [   13],        r/w,        0x1 */
            uint32_t reserved_14_15                 :  2; /* [15:14],       rsvd,        0x0 */
            uint32_t cr_i2c_end_clr                 :  1; /* [   16],        w1c,        0x0 */
            uint32_t rsvd_17                        :  1; /* [   17],       rsvd,        0x0 */
            uint32_t rsvd_18                        :  1; /* [   18],       rsvd,        0x0 */
            uint32_t cr_i2c_nak_clr                 :  1; /* [   19],        w1c,        0x0 */
            uint32_t cr_i2c_arb_clr                 :  1; /* [   20],        w1c,        0x0 */
            uint32_t rsvd_21                        :  1; /* [   21],       rsvd,        0x0 */
            uint32_t reserved_22_23                 :  2; /* [23:22],       rsvd,        0x0 */
            uint32_t cr_i2c_end_en                  :  1; /* [   24],        r/w,        0x1 */
            uint32_t cr_i2c_txf_en                  :  1; /* [   25],        r/w,        0x1 */
            uint32_t cr_i2c_rxf_en                  :  1; /* [   26],        r/w,        0x1 */
            uint32_t cr_i2c_nak_en                  :  1; /* [   27],        r/w,        0x1 */
            uint32_t cr_i2c_arb_en                  :  1; /* [   28],        r/w,        0x1 */
            uint32_t cr_i2c_fer_en                  :  1; /* [   29],        r/w,        0x1 */
            uint32_t reserved_30_31                 :  2; /* [31:30],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } i2c_int_sts;

    /* 0x8 : i2c_sub_addr */
    union {
        struct {
            uint32_t cr_i2c_sub_addr_b0             :  8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t cr_i2c_sub_addr_b1             :  8; /* [15: 8],        r/w,        0x0 */
            uint32_t cr_i2c_sub_addr_b2             :  8; /* [23:16],        r/w,        0x0 */
            uint32_t cr_i2c_sub_addr_b3             :  8; /* [31:24],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } i2c_sub_addr;

    /* 0xC : i2c_bus_busy */
    union {
        struct {
            uint32_t sts_i2c_bus_busy               :  1; /* [    0],          r,        0x0 */
            uint32_t cr_i2c_bus_busy_clr            :  1; /* [    1],        w1c,        0x0 */
            uint32_t reserved_2_31                  : 30; /* [31: 2],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } i2c_bus_busy;

